# AllowDuplicateNames Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeTypeOptions..::..AllowDuplicateNames Property
DirectShapeTypeOptions Class See Also
---
Determines whether or not duplicate DirectShapeType names are allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool AllowDuplicateNames { get; set; }
```

Visual Basic
---
```text
Public Property AllowDuplicateNames As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AllowDuplicateNames {
	bool get ();
	void set (bool value);
}
```

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace